[UIUtilities_LW]
;m_sAverageScatterText="± <XGParam:StrValue0/> Tiles"
m_sAverageScatterText1=""
m_sAverageScatterText2=""

[X2TargetingMethod_IRI_LWRocketLauncher]
strMaxScatter=""

[IRI_X2Rocket_Standard X2RocketTemplate]
FriendlyName="Rocket: Explosive"
FriendlyNamePlural="Explosive Rockets"
BriefSummary="A typical rocket-propelled grenade with high-explosive yield, produced in massive quantities by the end of the 20th century. It remains a reliable weapon, but may start to prove less effective as we encounter heavier ADVENT forces."
TacticalText="<Bullet/> Deals good direct and envrionmental damage, but suffers from explosive falloff.<br/><Bullet/> This rocket can scatter and miss its target. Rocket scatter gets worse after moving.<br/><Bullet/> Unlike grenades, rockets need to be armed before you can fire them. Soldiers can pass rockets between each other, including armed ones.<br/><Bullet/> Carried rockets reduce mobility until they are fired."
ThrownAbilityname="Fire Explosive Rocket"
ThrownAbilityHelpText="Fire a explosive rocket at target area."
GiveRocketAbilityName="Give explosive Rocket"
GiveArmedRocketAbilityName="Give Armed Explosive Rocket"
ArmRocketAbilityName="Arm Explosive Rocket"
ArmRocketFlyover="Explosive Rocket Armed"

[IRI_X2Rocket_Shredder X2RocketTemplate]
FriendlyName="Rocket: Shredder"
FriendlyNamePlural="Shredder Rockets"
BriefSummary="Based on original XCOM designs that were developed to effectively breach alien alloy plating with conventional materials, this specialized rocket sacrifices direct damage for the ability to shred significant amounts of armor."
TacticalText="<Bullet/> Shreds more armor and shatters targets, causing them to take +10% more damage from all sources.<br/><Bullet/> Only deals low damage that is further reduced by explosive falloff.<br/><Bullet/> Unlike grenades, rockets need to be armed before you can fire them. Soldiers can pass rockets between each other, including armed ones.<br/><Bullet/> Carried rockets reduce mobility until they are fired."
ThrownAbilityHelpText="Fire a shredder rocket at target area."
GiveRocketAbilityName="Give Shredder Rocket"
GiveArmedRocketAbilityName="Give Armed Shredder Rocket"
ArmRocketAbilityName="Arm Shredder Rocket"
ArmRocketFlyover="Shredder Rocket Armed"

[X2Rocket_Shredder]
ShredderEffectLocName="Shattered"
ShredderEffectLocDescription="This unit takes increased damage from all attacks."

[X2Effect_IRI_Shredded]
ShreddedFlyover="Shattered!"

[IRI_X2Rocket_Lockon X2RocketTemplate]
FriendlyName="Rocket: Lockon"
FriendlyNamePlural="Lockon Rockets"
BriefSummary="This rocket uses a makeshift missile guidance system with repurposed GREMLIN AI algorithms to attack Holo-Targeted or robotic enemies. The guidance system occupies a lot of space, so we replaced most of the explosive yield with a shaped charge to focus damage on the primary target."
TacticalText="<Bullet/> This rocket is fired against a single enemy. If it misses, it may damage units behind the intended target!<br/><Bullet/> Unlike grenades, rockets need to be armed before you can fire them. Soldiers can pass rockets between each other, including armed ones.<br/><Bullet/> Carried rockets reduce mobility until they are fired."
ThrownAbilityname="Fire Lockon"
ThrownAbilityHelpText="Fire the lockon rocket at a target." 
GiveRocketAbilityName="Give Lockon Rocket"
GiveArmedRocketAbilityName="Give Armed Lockon Rocket"
ArmRocketAbilityName="Arm Lockon Rocket"
ArmRocketFlyover="Lockon Rocket Armed"

[IRI_X2Rocket_Napalm X2RocketTemplate]
FriendlyName="Rocket: Napalm"
FriendlyNamePlural="Napalm Rockets"
BriefSummary="This heavy rocket carries an extremely volatile mix of Napalm-X and jellied Elerium that sticks to flammable materials. The effects on enemy morale are devastating, any enemies lit on fire by this rocket tend to scatter wildly to escape the heat."
TacticalText="<Bullet/> Inflicts a stronger burn effect, Sticky Flame, which causes targets to spread fire as they move and makes them easier to hit with reaction fire.<br/><Bullet/> Deals low initial damage that is unaffected by falloff.<br/><Bullet/> Fire immune enemies can not be affected by Sticky Flame, but still take some damage from the explosion.<br/><Bullet/> This rocket can scatter and miss its target. Rocket scatter gets worse after moving.<br/><Bullet/> Unlike grenades, rockets need to be armed before you can fire them. Soldiers can pass rockets between each other, including armed ones.<br/><Bullet/> Carried rockets reduce mobility until they are fired."
ThrownAbilityname="Fire Napalm Rocket"
ThrownAbilityHelpText="Fire a napalm rocket at target area."
GiveRocketAbilityName="Give Napalm Rocket"
GiveArmedRocketAbilityName="Give Armed Napalm Rocket"
ArmRocketAbilityName="Arm Napalm Rocket"
ArmRocketFlyover="Napalm Rocket Armed"

[X2Rocket_Napalm]
WildfireEffectName="Sticky Flame"
WildfireEffectDescription="This unit spreads fire as it moves and is easier to hit with reaction fire."

[IRI_X2Rocket_Flechette X2RocketTemplate]
FriendlyName="Rocket: Flechette"
FriendlyNamePlural="Flechette Rockets"
BriefSummary="This anti-personnel rocket disperses a rainstorm of razor-sharp alloy spikes over a large area. Highly effective against exposed infantry, but it's performance quickly degrades against armored, hardened or covered targets."
TacticalText="<Bullet/> Has high base damage that is effective against flanked targets. <br/><Bullet/> Deals less damage (-50%) against targets in low cover and against unflankable targets. Deals minimal damage (-75%) against targets in high cover.<br/><Bullet/> This rocket can scatter and miss its target. Rocket scatter gets worse after moving.<br/><Bullet/> Unlike grenades, rockets need to be armed before you can fire them. Soldiers can pass rockets between each other, including armed ones.<br/><Bullet/> Carried rockets reduce mobility until they are fired."
ThrownAbilityname="Fire Flechette Rocket"
ThrownAbilityHelpText="Fire a flechette rocket at a target area."
GiveRocketAbilityName="Give Flechette Rocket"
GiveArmedRocketAbilityName="Give Armed Flechette Rocket"
ArmRocketAbilityName="Arm Flechette Rocket"
ArmRocketFlyover="Flechette Rocket Armed"

[IRI_X2Rocket_Plasma X2RocketTemplate]
FriendlyName="Rocket: Plasma"
FriendlyNamePlural="Plasma Rockets"
BriefSummary="Desperate for any advantage, we took explosive charges from salvaged Alien Grenades and strapped them to a solid-fuel rocket engine. It's not pretty, but it's more powerful than any conventional rocket we could develop."
TacticalText="<Bullet/> Deals good direct and envrionmental damage, but suffers from explosive falloff.<br/><Bullet/> This rocket can scatter and miss its target. Rocket scatter gets worse after moving.<br/><Bullet/> Unlike grenades, rockets need to be armed before you can fire them. Soldiers can pass rockets between each other, including armed ones.<br/><Bullet/> Carried rockets reduce mobility until they are fired."
ThrownAbilityname="Fire Plasma Rocket"
ThrownAbilityHelpText="Fire a plasma rocket at target area."
GiveRocketAbilityName="Give Plasma Rocket"
GiveArmedRocketAbilityName="Give Armed Plasma Rocket"
ArmRocketAbilityName="Arm Plasma Rocket"
ArmRocketFlyover="Plasma Rocket Armed"

[IRI_X2Rocket_Shredder_T3 X2RocketTemplate]
FriendlyName="Rocket: Shredstorm"
FriendlyNamePlural="Shredstorm Rockets"
BriefSummary="An improved version of the Shredder rocket tested against the benchmark of ADVENT shieldbearer armor, the Shredstorm rocket destabilizes the structural integrity of affected units, significantly increasing damage taken from other sources."
TacticalText="<Bullet/> Shreds a lot of armor and shatters targets, causing them to take +33% more damage from all sources.<br/><Bullet/> Only deals low damage that is further reduced by explosive falloff.<br/><Bullet/> Unlike grenades, rockets need to be armed before you can fire them. Soldiers can pass rockets between each other, including armed ones.<br/><Bullet/> Carried rockets reduce mobility until they are fired."
ThrownAbilityname="Fire Shredstorm Rocket"
ThrownAbilityHelpText="Fire a Shredstorm rocket at target area."
GiveRocketAbilityName="Give Shredstorm Rocket"
GiveArmedRocketAbilityName="Give Armed Shredstorm Rocket"
ArmRocketAbilityName="Arm Shredstorm Rocket"
ArmRocketFlyover="Shredstorm Rocket Armed"

[IRI_X2Rocket_Sabot X2RocketTemplate]
FriendlyName="Rocket: Sabot"
FriendlyNamePlural="Sabot Rockets"
BriefSummary="With the rising threat of resilient organic foes, we have developed a fin-stabilized discarding sabot kinetic penetrator, designed to quite literally impale a target and, if it survives, atleast cause heavy internal bleeding."
TacticalText="<Bullet/> The Sabot projectile is fired against a single target, piercing cover and armor and rupturing it. <br/><Bullet/> The projectile is more likely to hit large targets, and more likely to deal critical damage to smaller targets. <br/><Bullet/> Biological enemies hit by the projectile will suffer massive bleeding damage until they die. <br/><Bullet/> Unlike grenades, rockets need to be armed before you can fire them. Soldiers can pass rockets between each other, including armed ones.<br/><Bullet/> Carried rockets reduce mobility until they are fired."
ThrownAbilityname="Fire Sabot"
ThrownAbilityHelpText="Fire a Sabot projectile at a target enemy."
GiveRocketAbilityName="Give Sabot Rocket"
GiveArmedRocketAbilityName="Give Armed Sabot Rocket"
ArmRocketAbilityName="Arm Sabot Rocket"
ArmRocketFlyover="Sabot Rocket Armed"

[IRI_X2Rocket_WhitePh X2RocketTemplate]
FriendlyName="Rocket: Phosphorous"
FriendlyNamePlural="Phosphorous Rockets"
BriefSummary="This rocket disperses white phosphorus over a large area, poisoning enemies and inflicting severe burns, as well as covering the area with a cloud of toxic smoke."
TacticalText="<Bullet/> Inflicts a strong poison that heavily debuffs enemy will and defenses, and creates a toxic cloud that causes the same effect.<br/><Bullet/> Also inflicts Burning and shreds some armor.<br/><Bullet/> Deals highly variable damage that is unaffected by falloff.<br/><Bullet/> This rocket can scatter and miss its target. Rocket scatter gets worse after moving.<br/><Bullet/> Unlike grenades, rockets need to be armed before you can fire them. Soldiers can pass rockets between each other, including armed ones.<br/><Bullet/> Carried rockets reduce mobility until they are fired."
ThrownAbilityname="Fire Phosphorous Rocket"
ThrownAbilityHelpText="Fire a phosphorous rocket at a target area."
GiveRocketAbilityName="Give Phosphorous Rocket"
GiveArmedRocketAbilityName="Give Armed Phosphorous Rocket"
ArmRocketAbilityName="Arm Phosphorous Rocket"
ArmRocketFlyover="Phosphorous Rocket Armed"

[IRI_X2Rocket_Thermobaric X2RocketTemplate]
FriendlyName="Rocket: Thermobaric"
FriendlyNamePlural="Thermobaric Rockets"
BriefSummary="Based on warheads salvaged from ADVENT micromissiles, the Thermobaric rocket disperses liquified Elerium and Alloy fragments and ignites them, creating a devastating pressure wave. It is extremely effective at destroying cover, and the resulting debree only worsens the effects against targets caught in the radius."
TacticalText="<Bullet/> Deals extremely high envrionmental damage, and deals bonus damage to each enemy based on the cover surrounding them. <br/><Bullet/> This rocket can scatter and miss its target. Rocket scatter gets worse after moving.<br/><Bullet/> Unlike grenades, rockets need to be armed before you can fire them. Soldiers can pass rockets between each other, including armed ones.<br/><Bullet/> Carried rockets reduce mobility until they are fired."
ThrownAbilityname="Fire Thermobaric Rocket"
ThrownAbilityHelpText="Fire a theromobaric rocket at a target area."
GiveRocketAbilityName="Give Thermobaric Rocket"
GiveArmedRocketAbilityName="Give Armed Thermobaric Rocket"
ArmRocketAbilityName="Arm Thermobaric Rocket"
ArmRocketFlyover="Thermobaric Rocket Armed"

[IRI_X2Rocket_Elerium X2RocketTemplate]
FriendlyName="Rocket: Elerium"
FriendlyNamePlural="Elerium Rockets"
BriefSummary="A highly exotic design based almost entirely on a Gatekeeper's beam weapon, the Elerium rocket bombards targets near the point of impact with powerful radiation, heavily disrupting organic and mechanical systems alike."
TacticalText="<Bullet/> Deals high, armor-ignoring damage, but only has a small radius and doesn't destroy cover.<br/><Bullet/> This rocket can scatter and miss its target. Rocket scatter gets worse after moving.<br/><Bullet/> Unlike grenades, rockets need to be armed before you can fire them. Soldiers can pass rockets between each other, including armed ones.<br/><Bullet/> Carried rockets reduce mobility until they are fired."
ThrownAbilityname="Fire Elerium Rocket"
ThrownAbilityHelpText="Fire an elerium rocket at target area."
GiveRocketAbilityName="Give Elerium Rocket"
GiveArmedRocketAbilityName="Give Armed Elerium Rocket"
ArmRocketAbilityName="Arm Elerium Rocket"
ArmRocketFlyover="Elerium Rocket Armed"

[IRI_X2Rocket_Plasma_Ejector X2RocketTemplate]
FriendlyName="Rocket: Blaster"
FriendlyNamePlural="Blaster Rockets"
BriefSummary="A retrofitted wrath cannon module from a destroyed sectopod, this weapon is less of a rocket and more of an oversized single-use energy weapon, projecting a massive beam of superheated plasma when fired from one of our rocket launchers."
TacticalText="<Bullet/> Deals a monstrous amount of damage and melts armor like it's nothing, but the plasma is highly unstable, and gets progressively weaker with distance, cover and additional targets. <br/><Bullet/> Most effective against priority targets at close range, or several weaker targets in a line. <br/><Bullet/> Carrying a Plasma Ejector incurs a mobility penalty.<br/><Bullet/> Unlike grenades, rockets need to be armed before you can fire them. Soldiers can pass rockets between each other, including armed ones.<br/><Bullet/> Carried rockets reduce mobility until they are fired."
ThrownAbilityname="Fire Blaster Rocket"
ThrownAbilityHelpText="Fire a Blaster Rocket at target area."
GiveRocketAbilityName="Give Blaster Rocket"
GiveArmedRocketAbilityName="Give Armed Blaster Rocket"
ArmRocketAbilityName="Arm Blaster Rocket"
ArmRocketFlyover="Blaster Rocket Armed"

[IRI_X2Rocket_Lockon_T3 X2RocketTemplate]
FriendlyName="Rocket: Falcon"
FriendlyNamePlural="Falcon Rockets"
BriefSummary="A highly mobile rocket design based on archon navigation and flight systems, the Falcon rocket is capable of coordinated strikes against holotargeted enemies, remaining highly accurate even at extreme ranges. It doesn't feature any direct fire capabilities, though."
TacticalText="<Bullet/> Unlike grenades, rockets need to be armed before you can fire them. Soldiers can pass rockets between each other, including armed ones.<br/><Bullet/> Carried rockets reduce mobility until they are fired."
ThrownAbilityname="Fire Falcon Rocket"
ThrownAbilityHelpText="Fire the Falcon rocket at a target." 
GiveRocketAbilityName="Give Falcon Rocket"
GiveArmedRocketAbilityName="Give Armed Falcon Rocket"
ArmRocketAbilityName="Arm Falcon Rocket"
ArmRocketFlyover="Falcon Rocket Armed"

[IRI_X2Rocket_Acid X2RocketTemplate]
FriendlyName="Rocket: Acid"
FriendlyNamePlural="Acid Rockets"
BriefSummary="This rocket disperses a large amount of highly caustic acid that is a byproduct of processing Elerium. When affected units take actions or receive damage from other sources, they will also suffer additional damage from the acid."
TacticalText="<Bullet/> Inflicts acid on targets. When affected units take actions or receive damage from other sources, they will also suffer additional damage from the acid.<br/><Bullet/> This rocket can scatter and miss its target. Rocket scatter gets worse after moving.<br/><Bullet/> Unlike grenades, rockets need to be armed before you can fire them. Soldiers can pass rockets between each other, including armed ones.<br/><Bullet/> Carried rockets reduce mobility until they are fired."
ThrownAbilityname="Fire Acid Rocket"
ThrownAbilityHelpText="Fire an acid rocket at a target area."
GiveRocketAbilityName="Give Acid Rocket"
GiveArmedRocketAbilityName="Give Armed Acid Rocket"
ArmRocketAbilityName="Arm Acid Rocket"
ArmRocketFlyover="Acid Rocket Armed"

[IRI_X2Rocket_Nuke X2RocketTemplate]
FriendlyName="Rocket: Nuke"
FriendlyNamePlural="Tactical Nukes"
BriefSummary="The Elerium Nuke is the most destructive tactical rocket in our arsenal. It relies on Refined Elerium detonation to jump start a Hydrogen fusion reaction, creating an explosion of immense power. Use it sparingly, Commander. We're trying to save the Earth, not turn it into a wasteland."
TacticalText="<Bullet/> Creates a massive explosion that ruptures enemies. Targets in the epicenter of the explosion take significantly more damage.<br/><Bullet/> This rocket can scatter and miss its target. Rocket scatter gets worse after moving.<br/><Bullet/> Unlike grenades, rockets need to be armed before you can fire them. Soldiers can pass rockets between each other, including armed ones.<br/><Bullet/> The Tactical Nuke also requires two actions to fire, and can not be disarmed. It will explode after 3 turns if not fired.<br/><Bullet/> Carrying a Tactical Nuke greatly reduces mobility until it is fired."
ThrownAbilityname="Fire Tactical Nuke"
ThrownAbilityHelpText="Fire a tactical elerium nuke at a target area."
GiveRocketAbilityName="Give Tactical Nuke"
GiveArmedRocketAbilityName="Give Armed Tactical Nuke"
ArmRocketAbilityName="Arm Tactical Nuke"
ArmRocketFlyover="Tactical Nuke Armed"